Documents/ПогрузкаЗаказовВАвтомобиль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПогрузкаЗаказовВАвтомобиль</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПогрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеДокументаЗагрузкаМашины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтгрузочныеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСборки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/НоменклатураГотоваяЕхатьККлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НоменклатураГотоваяЕхатьККлиенту</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСборкиНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СостояниеДокументаЗагрузкаМашины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостояниеДокументаЗагрузкаМашины</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Грузится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПогрузкаЗаказовВАвтомобиль/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.НоменклатураНаПогрузкеВАвтомобиль.Записывать = Истина;
	Движения.НоменклатураГотоваяЕхатьККлиенту.Записывать = Истина;
	Движения.ВодителяНаМаршрут.Записывать = Истина;
	
	Если СостояниеПогрузки  = Перечисления.СостояниеДокументаЗагрузкаМашины.Грузится Тогда
		
		Движение = Движения.НоменклатураНаПогрузкеВАвтомобиль.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДокументПогрузкиВМашину = Ссылка;
		Движение.Регистратор = Ссылка;
		Движение.Количество = 1;
		
	КонецЕсли;
	
	Если СостояниеПогрузки  = Перечисления.СостояниеДокументаЗагрузкаМашины.Загружен Тогда
		
		Движение = Движения.ВодителяНаМаршрут.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Водитель = Водитель;
		Движение.Контрагент = Контрагент;
		Движение.ДокументПогрузки = Ссылка;
		Движение.Регистратор = Ссылка;
		Движение.Количество = 1;
		
	КонецЕсли;
	
	Для Каждого ТекСтр из ОтгрузочныеМеста Цикл
		
		Движение = Движения.НоменклатураГотоваяЕхатьККлиенту.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДокументСборкиНоменклатуры = ТекСтр.ДокументСборки;
		Движение.Регистратор = Ссылка;
		Движение.Количество = 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Если номенклатура + заказ покупателя участвовали в движениях регистра "ТоварыНазначенныеНаСборку"     то отмена проведения НЕВОЗМОЖНА
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВодителяНаМаршрутОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.ВодителяНаМаршрут.Обороты(
	|			&Д1,
	|			&Д2,
	|			Регистратор,
	|			Водитель = &Водитель
	|				И ДокументПогрузки = &ДокументПогрузки) КАК ВодителяНаМаршрутОбороты";
	
	Запрос.УстановитьПараметр("Д1", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Д2", ТекущаяДата());
	Запрос.УстановитьПараметр("Водитель", Водитель);
	Запрос.УстановитьПараметр("ДокументПогрузки", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Сообщить("Отмена проведения НЕ ВОЗМОЖНА!", СтатусСообщения.ОченьВажное);
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослатьСообщение()  Экспорт 
	
	Если СостояниеПогрузки = Перечисления.СостояниеДокументаЗагрузкаМашины.Грузится Тогда
		
		Предупреждение("Машина еще не погружена", 20);
		Возврат;
		
	КонецЕсли;
	
	// Какие товары отгружены и сколько - узнаю из движения документа "Документ сборки"
	ФильтрПоДокументам = Новый Массив;
	ФильтрПоДокументам = ОтгрузочныеМеста.ВыгрузитьКолонку("ДокументСборки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыНазначенныеНаСборку.ЗаказПокупателя,
	|	ТоварыНазначенныеНаСборку.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(бит_СоставЗаказа.IDСтроки, """") КАК НомерПортала,
	|	ЕСТЬNULL(бит_СоставЗаказа.Цена, 0) КАК Цена,
	|	ТоварыНазначенныеНаСборку.Количество
	|ИЗ
	|	РегистрНакопления.ТоварыНазначенныеНаСборку КАК ТоварыНазначенныеНаСборку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоставЗаказа КАК бит_СоставЗаказа
	|		ПО ТоварыНазначенныеНаСборку.ЗаказПокупателя = бит_СоставЗаказа.Заказ
	|			И ТоварыНазначенныеНаСборку.Номенклатура = бит_СоставЗаказа.Номенклатура
	|ГДЕ
	|	ТоварыНазначенныеНаСборку.Регистратор В(&Регистратор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПортала,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Регистратор", ФильтрПоДокументам);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		Макет = ПолучитьМакет("Послание");
		ТабДок = Новый ТабличныйДокумент;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Контрагент = Контрагент;
		ТабДок.Вывести(ОбластьМакета);
		Всего = 0;
		
		Пока Выборка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.НомерНаПортале = Выборка.НомерПортала;
			ОбластьМакета.Параметры.Номенклатура = Выборка.Номенклатура ;
			ОбластьМакета.Параметры.Кол = Выборка.Количество;
			ОбластьМакета.Параметры.Цена = Выборка.Цена;
			ОбластьМакета.Параметры.Сумма = ОбластьМакета.Параметры.Кол * ОбластьМакета.Параметры.Цена;                                                                     
			ТабДок.Вывести(ОбластьМакета);
			Всего = Всего + ОбластьМакета.Параметры.Сумма;
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.МенеджерКонтрагента = Контрагент.МенеджерМСК;
		ОбластьМакета.Параметры.Телефон = МСК.ПолучитьТелефоныМенеджераМСК(Контрагент.МенеджерМСК);
		ОбластьМакета.Параметры.ВсегоСумма = Всего; 
			
		//+Гавриленков В. 21.01.2026 #UT10-5645
		//ВсегоНДС = Всего * 20/120;
		ВсегоНДС = Всего * ?(ТекущаяДата() >= '20260101', 22/122, ?(ТекущаяДата()>= Дата("20190101000000"), 20/120,  18/118));
		//-Гавриленков В. 21.01.2026 #UT10-5645

		ОбластьМакета.Параметры.ВсегоНДС = ВсегоНДС;
		ТабДок.Вывести(ОбластьМакета);
		ТабДок.Записать(КаталогВременныхФайлов() + "\Послание.xls", ТипФайлаТабличногоДокумента.XLS);
		
		ОсновнаяУчетнаяЗапись = МСК.ПолучитьУчетнуюЗаписьПользователя(ПараметрыСеанса.ТекущийПользователь);
		
		// Получаю адрес контрагента
		Запрос = Новый Запрос;
		
		МылоКонтрагента =  МСК.ПолучитьЭлектронныйАдрес(Контрагент);
		
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
		
		Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда 
			Возврат;
		КонецЕсли;
		
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		
		Почта = Новый ИнтернетПочта; 
		
		Попытка
			Почта.Подключиться(Профиль);
		Исключение
			
			Сообщить("Не удалось подключиться к почтовому серверу. Послание НЕ отправлено!");
			Возврат;
			
		КонецПопытки;

		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = "Извещение об отгрузке номенклатуры от Москворечья";
		
		МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(МылоКонтрагента, ";");
		
		Для каждого ТекАдрес Из МассивАдресов Цикл
			Сообщение.Получатели.Добавить(ТекАдрес); 
		КонецЦикла;
		
		Сообщение.Тексты.Добавить("Подтвердите получение извещения");
		Сообщение.АдресаУведомленияОПрочтении.Добавить(УчетнаяЗапись.АдресЭлектроннойПочты);
		Сообщение.УведомитьОПрочтении = Истина;
		Сообщение.Отправитель = ОсновнаяУчетнаяЗапись.АдресЭлектроннойПочты;
		Сообщение.Вложения.Добавить(КаталогВременныхФайлов() + "\Послание.xls", ТипФайлаТабличногоДокумента.XLS);
		
		Почта.Послать(Сообщение);
		Почта.Отключиться();
		
	КонецЕсли; 	

КонецПроцедуры
